#!/bin/bash

# Set install mode to online since boot.sh is used for curl installations
export anarchy_ONLINE_INSTALL=true

ansi_art=`          ▄▄██  ▄▄
       ▄██████  ███████▄    ▄███████   ▄███████   ▄███████   ▄█   █▄    ▄█   █▄
      ███▀  ██  ▀██   ███  ███   ███  ███   ███  ███   ███  ███   ███  ███   ███
     ███    ██   ██   ███  ███   ███  ███   ███  ███   █▀   ███   ███  ███   ███
 ▄▄▄███▄▄▄▄▄██▄▄ ██   ███ ▄███▄▄▄███ ▄███▄▄▄██▀  ███       ▄███▄▄▄███▄ ███▄▄▄███
  ▀▀███▀▀▀▀▀██▀▀ ██   ███ ▀███▀▀▀███ ▀███▀▀▀▀    ███      ▀▀███▀▀▀███  ▀▀███████
     ██▄    ██   ██   ███  ███   ███ ██████████  ███   █▄   ███   ███        ███
     ▀██▄   ██   ██   ███  ███   ███  ███   ███  ███   ███  ███   ███       ▄███
      ▀███  ██  ██▀   █▀   ███   █▀   ███   ███  ███████▀   ███   █▀       ▄██▀
        ▀▀  ██                        ███   █▀                         ▄▄████▀
            ▀█                                 ░░░░▒▒▒▒▓▓▓▓██████████████▀▀`

clear
echo -e "\n$ansi_art\n"

echo 'Server = https://fastly.mirror.pkgbuild.com/$repo/os/$arch' | sudo tee /etc/pacman.d/mirrorlist >/dev/null

sudo pacman -Syu --noconfirm --needed git

anarchy_REPO="${anarchy_REPO:-Pobedie/Anarchy}"

echo -e "\nCloning Anarchy from: https://github.com/${anarchy_REPO}.git"
rm -rf ~/.local/share/anarchy/
git clone "https://github.com/${anarchy_REPO}.git" ~/.local/share/anarchy >/dev/null

echo -e "\e[32mUsing branch: $anarchy_REF\e[0m"
cd ~/.local/share/anarchy
git fetch origin "${anarchy_REF}" && git checkout "${anarchy_REF}"
cd -

echo -e "\nInstallation starting..."
source ~/.local/share/anarchy/install.sh
